---
kind: property
id: P:Autodesk.Revit.DB.ScheduleDefinition.ShowGrandTotal
source: html/35773562-1a92-2ff5-ec65-51648998b6ea.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.ShowGrandTotal Property

Indicates if a grand total row should be displayed at the bottom of
 the schedule.

## Syntax (C#)
```csharp
public bool ShowGrandTotal { get; set; }
```

## Remarks
The grand total row displays totals of each field for which
 totals are enabled. It can also optionally display a title
 (see ShowGrandTotalTitle) and a count of elements
 (see ShowGrandTotalCount).